teleportboy/arm7_adc_imx8mp/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#include "fsl_common.h"
#include "fsl_iomuxc.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    //pinctrl_hog();
    //pinctrl_backlight();
    pinctrl_adc();
    //pinctrl_fec();
//     pinctrl_flexcan1();
//     pinctrl_flexcan2();
//     pinctrl_gpio_led();
//     pinctrl_lpddr4();
//     pinctrl_earc();
//     pinctrl_hdmi();
//     pinctrl_i2c1();
//     pinctrl_i2c2();
//     pinctrl_i2c5();
//     //pinctrl_jtag();
//     pinctrl_lvds0();
//     pinctrl_pmic();
//     pinctrl_flexspi0();
//     pinctrl_sai3_audio();
//     pinctrl_sai5_mic();
//     pinctrl_snvs();
//     pinctrl_wdog();
//     pinctrl_uart1_485();
       //pinctrl_uart2_gnss1();
//     pinctrl_uart3_gnss2();
//     pinctrl_uart4_485();
//     pinctrl_usb1_vbus();
//     pinctrl_usdhc2();
//     pinctrl_usdhc3();
//     pinctrl_usb1();
//     pinctrl_usb2();
//     pinctrl_bat_ic();
//     pinctrl_eqos();
//     pinctrl_fram();
}

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_hog
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_hog(void) {                                   /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_HDMI_CEC_HDMIMIX_HDMI_CEC, 0U);
    IOMUXC_SetPinConfig(IOMUXC_HDMI_CEC_HDMIMIX_HDMI_CEC, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(1U) |
                        IOMUXC_SW_PAD_CTL_PAD_FSEL_MASK);
    IOMUXC_SetPinMux(IOMUXC_HDMI_DDC_SCL_HDMIMIX_HDMI_SCL, 0U);
    IOMUXC_SetPinConfig(IOMUXC_HDMI_DDC_SCL_HDMIMIX_HDMI_SCL, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
    IOMUXC_SetPinMux(IOMUXC_HDMI_DDC_SDA_HDMIMIX_HDMI_SDA, 0U);
    IOMUXC_SetPinConfig(IOMUXC_HDMI_DDC_SDA_HDMIMIX_HDMI_SDA, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
    IOMUXC_SetPinMux(IOMUXC_HDMI_HPD_HDMIMIX_HDMI_HPD, 0U);
    IOMUXC_SetPinConfig(IOMUXC_HDMI_HPD_HDMIMIX_HDMI_HPD, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(1U) |
                        IOMUXC_SW_PAD_CTL_PAD_FSEL_MASK);
    IOMUXC_SetPinMux(IOMUXC_SAI1_MCLK_GPIO4_IO20, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SAI1_MCLK_GPIO4_IO20, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(3U) |
                        IOMUXC_SW_PAD_CTL_PAD_FSEL_MASK);
    IOMUXC_SetPinMux(IOMUXC_SAI1_TXD0_GPIO4_IO12, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SAI1_TXD0_GPIO4_IO12, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(3U));
    IOMUXC_SetPinMux(IOMUXC_SAI1_TXD7_GPIO4_IO19, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SAI1_TXD7_GPIO4_IO19, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(3U) |
                        IOMUXC_SW_PAD_CTL_PAD_FSEL_MASK);
    IOMUXC_SetPinMux(IOMUXC_SAI2_RXFS_GPIO4_IO21, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SAI2_RXFS_GPIO4_IO21, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(3U) |
                        IOMUXC_SW_PAD_CTL_PAD_FSEL_MASK);
    IOMUXC_SetPinMux(IOMUXC_SAI5_RXC_GPIO3_IO20, 0U);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_backlight
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_backlight(void) {                             /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_SPDIF_EXT_CLK_PWM1_OUT, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SPDIF_EXT_CLK_PWM1_OUT, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(3U) |
                        IOMUXC_SW_PAD_CTL_PAD_FSEL_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_adc
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_adc(void) {                                   /*!< Function assigned for the core: Cortex-A53[a53_0] */
    // IOMUXC_SetPinMux(IOMUXC_ECSPI2_SS0_ECSPI2_SS0, 0U);
    // IOMUXC_SetPinConfig(IOMUXC_ECSPI2_SS0_ECSPI2_SS0, 
    //                     IOMUXC_SW_PAD_CTL_PAD_DSE(0U) |
    //                     IOMUXC_SW_PAD_CTL_PAD_HYS_MASK);

    // IOMUXC_SetPinMux(IOMUXC_I2C3_SCL_ECSPI2_SCLK, 0U);
    // IOMUXC_SetPinConfig(IOMUXC_I2C3_SCL_ECSPI2_SCLK, 
    //                      IOMUXC_SW_PAD_CTL_PAD_DSE(0U) |
    //                      IOMUXC_SW_PAD_CTL_PAD_HYS_MASK);

    // IOMUXC_SetPinMux(IOMUXC_I2C3_SDA_ECSPI2_MOSI, 0U);
    // IOMUXC_SetPinConfig(IOMUXC_I2C3_SDA_ECSPI2_MOSI, 
    //                     IOMUXC_SW_PAD_CTL_PAD_DSE(0U) |
    //                     IOMUXC_SW_PAD_CTL_PAD_PE_MASK);

