teleportboy/arm7_adc_imx8mp/board/pin_mux.c
    // IOMUXC_SetPinMux(IOMUXC_I2C4_SCL_ECSPI2_MISO, 0U);
    // IOMUXC_SetPinConfig(IOMUXC_I2C4_SCL_ECSPI2_MISO, 
    //                     IOMUXC_SW_PAD_CTL_PAD_DSE(0U) |
    //                     IOMUXC_SW_PAD_CTL_PAD_HYS_MASK);

    // IOMUXC_SetPinMux(IOMUXC_SAI3_RXD_GPIO4_IO30, 0U);
    // IOMUXC_SetPinConfig(IOMUXC_SAI3_RXD_GPIO4_IO30, 
    //                     IOMUXC_SW_PAD_CTL_PAD_DSE(3U) |
    //                     IOMUXC_SW_PAD_CTL_PAD_PE_MASK);


    IOMUXC_SetPinMux(IOMUXC_I2C3_SCL_ECSPI2_SCLK, 0U);
    IOMUXC_SetPinConfig(IOMUXC_I2C3_SCL_ECSPI2_SCLK, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK);
    IOMUXC_SetPinMux(IOMUXC_I2C3_SDA_ECSPI2_MOSI, 0U);
    IOMUXC_SetPinConfig(IOMUXC_I2C3_SDA_ECSPI2_MOSI, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK);
    
    
    IOMUXC_SetPinMux(IOMUXC_I2C4_SCL_ECSPI2_MISO, 0U);
    IOMUXC_SetPinConfig(IOMUXC_I2C4_SCL_ECSPI2_MISO, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK);
    IOMUXC_SetPinMux(IOMUXC_ECSPI2_SS0_ECSPI2_SS0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_ECSPI2_SS0_ECSPI2_SS0, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK);
    //pd/rst
    IOMUXC_SetPinMux(IOMUXC_SD2_CD_B_GPIO2_IO12, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SD2_CD_B_GPIO2_IO12, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK);


    IOMUXC_SetPinMux(IOMUXC_SAI1_MCLK_GPIO4_IO20, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SAI1_MCLK_GPIO4_IO20,
                        IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK);

    IOMUXC_SetPinMux(IOMUXC_SAI1_TXD0_GPIO4_IO12, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SAI1_TXD0_GPIO4_IO12,
                        IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK);

    IOMUXC_SetPinMux(IOMUXC_SAI1_TXD7_GPIO4_IO19, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SAI1_TXD7_GPIO4_IO19,
                        IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK);

    IOMUXC_SetPinMux(IOMUXC_SAI2_RXFS_GPIO4_IO21, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SAI2_RXFS_GPIO4_IO21,
                        IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_fec
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_fec(void) {                                   /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_SAI1_RXD6_ENET1_RGMII_RD2, 0U);
    IOMUXC_SetPinMux(IOMUXC_SAI1_RXD7_ENET1_RGMII_RD3, 0U);
    IOMUXC_SetPinMux(IOMUXC_SAI1_TXC_ENET1_RGMII_RXC, 0U);
    IOMUXC_SetPinMux(IOMUXC_SAI1_TXD2_ENET1_RGMII_TD2, 0U);
    IOMUXC_SetPinMux(IOMUXC_SAI1_TXD3_ENET1_RGMII_TD3, 0U);
    IOMUXC_SetPinMux(IOMUXC_SAI1_TXD4_ENET1_RGMII_TX_CTL, 0U);
    IOMUXC_SetPinMux(IOMUXC_SAI1_TXD5_ENET1_RGMII_TXC, 0U);
    IOMUXC_SetPinMux(IOMUXC_SAI1_TXFS_ENET1_RGMII_RX_CTL, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD1_CLK_ENET1_MDC, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD1_CMD_ENET1_MDIO, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD1_DATA0_ENET1_RGMII_TD1, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD1_DATA1_ENET1_RGMII_TD0, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD1_DATA2_ENET1_RGMII_RD0, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD1_DATA3_ENET1_RGMII_RD1, 0U);
    IOMUXC_SetPinMux(IOMUXC_SD2_WP_GPIO2_IO20, 0U);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_flexcan1
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_flexcan1(void) {                              /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_SAI2_TXC_CAN1_RX, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SAI2_TXC_CAN1_RX, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
                        IOMUXC_SW_PAD_CTL_PAD_FSEL_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
    IOMUXC_SetPinMux(IOMUXC_SPDIF_TX_CAN1_TX, 0U);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_flexcan2
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_flexcan2(void) {                              /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_SAI2_MCLK_CAN2_RX, 0U);
    IOMUXC_SetPinMux(IOMUXC_SAI2_TXD0_CAN2_TX, 0U);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_gpio_led
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_gpio_led(void) {                              /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_GPIO1_IO12_GPIO1_IO12, 0U);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_lpddr4
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_lpddr4(void) {                                /*!< Function assigned for the core: Cortex-A53[a53_0] */
}


