teleportboy/arm7_adc_imx8mp/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_earc
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_earc(void) {                                  /*!< Function assigned for the core: Cortex-A53[a53_0] */
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_hdmi
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_hdmi(void) {                                  /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_HDMI_CEC_HDMIMIX_HDMI_CEC, 0U);
    IOMUXC_SetPinMux(IOMUXC_HDMI_DDC_SCL_HDMIMIX_HDMI_SCL, 0U);
    IOMUXC_SetPinMux(IOMUXC_HDMI_DDC_SDA_HDMIMIX_HDMI_SDA, 0U);
    IOMUXC_SetPinMux(IOMUXC_HDMI_HPD_HDMIMIX_HDMI_HPD, 0U);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_i2c1
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_i2c1(void) {                                  /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_I2C1_SCL_I2C1_SCL, 0U);
    IOMUXC_SetPinConfig(IOMUXC_I2C1_SCL_I2C1_SCL, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
    IOMUXC_SetPinMux(IOMUXC_I2C1_SDA_I2C1_SDA, 0U);
    IOMUXC_SetPinConfig(IOMUXC_I2C1_SDA_I2C1_SDA, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_i2c2
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_i2c2(void) {                                  /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_I2C2_SCL_I2C2_SCL, 0U);
    IOMUXC_SetPinConfig(IOMUXC_I2C2_SCL_I2C2_SCL, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
                        IOMUXC_SW_PAD_CTL_PAD_ODE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
    IOMUXC_SetPinMux(IOMUXC_I2C2_SDA_I2C2_SDA, 0U);
    IOMUXC_SetPinConfig(IOMUXC_I2C2_SDA_I2C2_SDA, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
                        IOMUXC_SW_PAD_CTL_PAD_ODE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_i2c5
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_i2c5(void) {                                  /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_SAI5_MCLK_I2C5_SDA, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SAI5_MCLK_I2C5_SDA, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
                        IOMUXC_SW_PAD_CTL_PAD_ODE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
    IOMUXC_SetPinMux(IOMUXC_SAI5_RXD0_I2C5_SCL, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SAI5_RXD0_I2C5_SCL, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
                        IOMUXC_SW_PAD_CTL_PAD_ODE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_jtag
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
// void pinctrl_jtag(void) {                                  /*!< Function assigned for the core: Cortex-A53[a53_0] */
//     IOMUXC_SetPinConfig(IOMUXC_JTAG_MOD, 
//                         IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
//                         IOMUXC_SW_PAD_CTL_PAD_FSEL_MASK |
//                         IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
//     IOMUXC_SetPinConfig(IOMUXC_JTAG_TCK, 
//                         IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
//                         IOMUXC_SW_PAD_CTL_PAD_FSEL_MASK |
//                         IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
//     IOMUXC_SetPinConfig(IOMUXC_JTAG_TDI, 
//                         IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
//                         IOMUXC_SW_PAD_CTL_PAD_FSEL_MASK |
//                         IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
//     IOMUXC_SetPinConfig(IOMUXC_JTAG_TDO,
//                         IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
//                         IOMUXC_SW_PAD_CTL_PAD_FSEL_MASK |
//                         IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
//     IOMUXC_SetPinConfig(IOMUXC_JTAG_TMS, 
//                         IOMUXC_SW_PAD_CTL_PAD_DSE(2U) |
//                         IOMUXC_SW_PAD_CTL_PAD_FSEL_MASK |
//                         IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
// }


