teleportboy/arm7_adc_imx8mp/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_uart1_485
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_uart1_485(void) {                             /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_SAI2_RXC_UART1_RX, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SAI2_RXC_UART1_RX, 
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
    IOMUXC_SetPinMux(IOMUXC_SAI2_TXFS_UART1_RTS_B, 0U);
    IOMUXC_SetPinMux(IOMUXC_UART1_TXD_UART1_TX, 0U);
    IOMUXC_SetPinConfig(IOMUXC_UART1_TXD_UART1_TX, 
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_uart2_gnss1
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_uart2_gnss1(void) {                           /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_UART2_RXD_UART2_RX, 0U);
    IOMUXC_SetPinConfig(IOMUXC_UART2_RXD_UART2_RX, 
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK);
    IOMUXC_SetPinMux(IOMUXC_UART2_TXD_UART2_TX, 0U);
    IOMUXC_SetPinConfig(IOMUXC_UART2_TXD_UART2_TX, 
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_uart3_gnss2
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_uart3_gnss2(void) {                           /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_UART3_RXD_UART3_RX, 0U);
    IOMUXC_SetPinConfig(IOMUXC_UART3_RXD_UART3_RX, 
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
    IOMUXC_SetPinMux(IOMUXC_UART3_TXD_UART3_TX, 0U);
    IOMUXC_SetPinConfig(IOMUXC_UART3_TXD_UART3_TX, 
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_uart4_485
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_uart4_485(void) {                             /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_ECSPI2_MISO_UART4_RTS_B, 0U);
    IOMUXC_SetPinMux(IOMUXC_ECSPI2_MOSI_UART4_TX, 0U);
    IOMUXC_SetPinMux(IOMUXC_ECSPI2_SCLK_UART4_RX, 0U);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_usb1_vbus
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_usb1_vbus(void) {                             /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_GPIO1_IO14_GPIO1_IO14, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO1_IO14_GPIO1_IO14, 
                        IOMUXC_SW_PAD_CTL_PAD_FSEL_MASK);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_usdhc2
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_usdhc2(void) {                                /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_GPIO1_IO04_USDHC2_VSELECT, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO1_IO04_USDHC2_VSELECT, 
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK);
    IOMUXC_SetPinMux(IOMUXC_SD2_CLK_USDHC2_CLK, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SD2_CLK_USDHC2_CLK, 
                        IOMUXC_SW_PAD_CTL_PAD_FSEL_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
    IOMUXC_SetPinMux(IOMUXC_SD2_CMD_USDHC2_CMD, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SD2_CMD_USDHC2_CMD, 
                        IOMUXC_SW_PAD_CTL_PAD_FSEL_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
    IOMUXC_SetPinMux(IOMUXC_SD2_DATA0_USDHC2_DATA0, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SD2_DATA0_USDHC2_DATA0, 
                        IOMUXC_SW_PAD_CTL_PAD_FSEL_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
    IOMUXC_SetPinMux(IOMUXC_SD2_DATA1_USDHC2_DATA1, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SD2_DATA1_USDHC2_DATA1, 
                        IOMUXC_SW_PAD_CTL_PAD_FSEL_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
    IOMUXC_SetPinMux(IOMUXC_SD2_DATA2_USDHC2_DATA2, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SD2_DATA2_USDHC2_DATA2, 
                        IOMUXC_SW_PAD_CTL_PAD_FSEL_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
    IOMUXC_SetPinMux(IOMUXC_SD2_DATA3_USDHC2_DATA3, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SD2_DATA3_USDHC2_DATA3, 
                        IOMUXC_SW_PAD_CTL_PAD_FSEL_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_HYS_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
    IOMUXC_SetPinMux(IOMUXC_SD2_RESET_B_USDHC2_RESET_B, 0U);
}


