teleportboy/arm7_adc_imx8mp/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_usdhc3
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_usdhc3(void) {                                /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_NAND_CE1_B_USDHC3_STROBE, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_CE2_B_USDHC3_DATA5, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_CE3_B_USDHC3_DATA6, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_CLE_USDHC3_DATA7, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_DATA04_USDHC3_DATA0, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_DATA05_USDHC3_DATA1, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_DATA06_USDHC3_DATA2, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_DATA07_USDHC3_DATA3, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_RE_B_USDHC3_DATA4, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_WE_B_USDHC3_CLK, 0U);
    IOMUXC_SetPinMux(IOMUXC_NAND_WP_B_USDHC3_CMD, 0U);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_usb1
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_usb1(void) {                                  /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_GPIO1_IO00_GPIO1_IO00, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO1_IO00_GPIO1_IO00, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(3U));
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_usb2
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_usb2(void) {                                  /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_SPDIF_RX_GPIO5_IO04, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SPDIF_RX_GPIO5_IO04, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(3U));
    IOMUXC_SetPinMux(IOMUXC_UART1_RXD_GPIO5_IO22, 0U);
    IOMUXC_SetPinConfig(IOMUXC_UART1_RXD_GPIO5_IO22, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(3U));
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_bat_ic
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_bat_ic(void) {                                /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_GPIO1_IO01_GPIO1_IO01, 0U);
    IOMUXC_SetPinConfig(IOMUXC_GPIO1_IO01_GPIO1_IO01, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(3U) |
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK);
    IOMUXC_SetPinMux(IOMUXC_SD1_RESET_B_GPIO2_IO10, 0U);
    IOMUXC_SetPinConfig(IOMUXC_SD1_RESET_B_GPIO2_IO10, 
                        IOMUXC_SW_PAD_CTL_PAD_DSE(1U) |
                        IOMUXC_SW_PAD_CTL_PAD_PUE_MASK |
                        IOMUXC_SW_PAD_CTL_PAD_PE_MASK);
    IOMUXC_SetPinMux(IOMUXC_UART4_RXD_I2C6_SCL, 0U);
    IOMUXC_SetPinMux(IOMUXC_UART4_TXD_I2C6_SDA, 0U);
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_eqos
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_eqos(void) {                                  /*!< Function assigned for the core: Cortex-A53[a53_0] */
}


/* FUNCTION ************************************************************************************************************
 *
 * Function Name : pinctrl_fram
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void pinctrl_fram(void) {                                  /*!< Function assigned for the core: Cortex-A53[a53_0] */
    IOMUXC_SetPinMux(IOMUXC_SD2_CD_B_GPIO2_IO12, 0U);
}

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
